---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInDesignOption
source: html/7a4777ab-ca66-2734-8e5e-ceea539db2e1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInDesignOption Property

An insert in the main model cannot be hosted by an element in a Design Option [--if you continue it will not be added to the design option set].

## Syntax (C#)
```csharp
public static FailureDefinitionId ConfusingHostByElementsInDesignOption { get; }
```